---
kind: method
id: M:Autodesk.Revit.DB.PointClouds.PointCloudFilter.Clone
source: html/63fdeb18-9ec3-3202-aa60-d88c3c65233a.htm
---
# Autodesk.Revit.DB.PointClouds.PointCloudFilter.Clone Method

Returns a copy of the filter. The engine is permitted to copy the filter multiple times e.g. to parallelize filtering.

## Syntax (C#)
```csharp
public PointCloudFilter Clone()
```

## Returns
A copy of the original filter.